INSERT INTO 
	musicians(name)
values
	('Баста'),
	('Король и шут'),
	('Кино'),
	('Би-2'),
	('Руки вверх'),
	('Rammstein'),
	('Михаил Круг'),
	('Ария')
INSERT INTO 
	styles(name)
values
	('Рэп'),
	('Рок'),
	('Поп'),
	('Индастриал'),
	('Шансон'),
	('Хэви-метал')

INSERT INTO 
	albums(name,year)
values
	('Армагедон', 2020),
	('XX лет', 2021),
	('TODD', 2020),
	('Осень', 2022),
	('Чёрный альбом', 1990),
	('Звёзды дискотек', 2022),
	('Пекло', 2018),
	('Paris', 2017)
	
INSERT INTO 
	songs (name, duration, album_id)
values
	('Штиль', '285', 11),
	('Последний закат', '255', 10),
	('Баллада о бедном цирюльнике', '244', 12),
	('Машина смерти', '289', 12),
	('Осень', '237', 13),
	('Кончится лето', '324', 14),
	('Кукушка', '387', 14),
	('Мой Одиночка', '147', 15),
	('Ты мне не снишься', '214', 15),
	('Мосты', '334', 16),
	('Intro', '279', 17)
	
INSERT INTO 
	collections  (name, year)
values
('Русский рок', 2020),
('Хиты рэпа', 2022),
('Нашествие 2020', 2020),
('Радио', 2021),
('Иностранщина', 2019),
('Ностальгия', 2018),
('Парк горького', 2021),
('Пограничник', 2020)
	
INSERT INTO 
	musicians_styles (musician_id, style_id)
values
	(2, 1),
	(3, 2),
	(4, 2),
	(5, 2),
	(6, 3),
	(7, 4),
	(8, 5),
	(9, 6)
	
INSERT INTO 
	musicians_albums (musician_id, album_id)
values
	(9, 10),
	(3, 11),
	(3, 12),
	(5, 13),
	(4, 14),
	(6, 15),
	(9, 16),
	(7, 17)

INSERT INTO 
	songs_collections (song_id, collection_id)
values
	(1, 1),
	(2, 1),
	(3, 1),
	(4, 1),
	(5, 2),
	(6, 3),
	(7, 4),
	(7, 5),
	(8, 6),
	(9, 7),
	(10, 8),
	(11, 8)

	